Public Attributes | List of all members
API_WindowInfo Struct Reference
Window Management
Identification parameters of a project window. More...
#include <APIdefs_Database.h>
 Public Attributes
API_WindowTypeID  | typeID
the window/database type identifier
Int32  | index
usually the database/window index (the refCon value in case of custom windows, not used for Section/Elevation Detail and Worksheet database/window).
API_DatabaseUnId  | databaseUnId
Section/Elevation/Interior Elevation, Detail and Worksheet database/window unique identifier.
API_DatabaseUnId  | masterLayoutUnId
for Layouts only; database unique ID of the master layout
GS::uchar_t  | title [API_UniLongNameLen]
the title of the database (Unicode string), as it is displayed on the window title bar (generally "ref"+" "+"name")
GS::uchar_t  | name [API_UniLongNameLen]
the name of the database (Unicode string)
GS::uchar_t  | ref [API_UniLongNameLen]
reference string/id of the database
API_Guid  | linkedElement
Element linked to the database (e.g., section to a section database) except for drawing databases where it is the drawing element's guid.
API_DatabaseUnId  | linkedDatabaseUnId
For databases linked to elements (section, detail, etc.): the database containing the element.
Int32  | linkedSegmentMemoIndex
For interior elevations only; the section segment index in the element memo.
Detailed Description
Identification parameters of a project window.
Remarks
Database/Window reference is used for several purposes:
Returned while asking for the active window or database
Must be setup when changing the current window or database
Defines the database when creating/modifying/deleting an independent detail, worksheet, layout or master layout database The databases are referenced with their unique ID, except Floor Plan, 3D Model, and custom window databases. The unique IDs can be found in the connecting elements (API_CutPlaneType, API_DetailType, API_WorksheetType), or can be listed for independent detail, worksheet, layout and master layout databases (ACAPI_Database_GetDetailDatabases, ACAPI_Database_GetWorksheetDatabases, ACAPI_Database_GetLayoutDatabases, ACAPI_Database_GetMasterLayoutDatabases respectively). In the case of Floor Plan and 3D Model databases, the typeID field is enough to identify them. Custom API windows (APIWind_MyDrawID, APIWind_MyTextID) are identified with typeID and index. Featuring API 10 With this structure, you can retrieve the name, the title, and the reference ID of a given window/database (see ACAPI_Window_GetDatabaseInfo). You can also rename independent detail, worksheet, layout and master layout databases using the name and ref fields in ACAPI_Database_ModifyDatabase.
Member Data Documentation
◆ databaseUnId
 API_WindowInfo::databaseUnId
Section/Elevation/Interior Elevation, Detail and Worksheet database/window unique identifier.
◆ index
 API_WindowInfo::index
usually the database/window index (the refCon value in case of custom windows, not used for Section/Elevation Detail and Worksheet database/window).
◆ linkedDatabaseUnId
 API_WindowInfo::linkedDatabaseUnId
For databases linked to elements (section, detail, etc.): the database containing the element.
◆ linkedElement
 API_WindowInfo::linkedElement
Element linked to the database (e.g., section to a section database) except for drawing databases where it is the drawing element's guid.
◆ linkedSegmentMemoIndex
 API_WindowInfo::linkedSegmentMemoIndex
For interior elevations only; the section segment index in the element memo.
◆ masterLayoutUnId
 API_WindowInfo::masterLayoutUnId
for Layouts only; database unique ID of the master layout
◆ name
 API_WindowInfo::name
the name of the database (Unicode string)
◆ ref
 API_WindowInfo::ref
reference string/id of the database
◆ title
 API_WindowInfo::title
the title of the database (Unicode string), as it is displayed on the window title bar (generally "ref"+" "+"name")
◆ typeID
 API_WindowInfo::typeID
the window/database type identifier